# Project - Analyzing Indian Flight Prices and Patterns
### **Team members**
##### 1: suraj -- Data Cleaning 
##### 2: Afifa -- EDA(Exploratory Data Analysis)
##### 3: shubham -- SQL(structured query language)

In [1]:
import pandas as pd 
import numpy as np

# First table

In [176]:
df1 = pd.read_csv('Indian_Airlines.csv', index_col=0)
df.head(2)

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953

**columns name**

In [497]:
df1.columns

Index(['Airline', 'Flight', 'Source_city', 'Departure_time', 'Stops',
       'Arrival_time', 'Destination_city', 'Class', 'Duration', 'Days_left',
       'Price'],
      dtype='object')

**rows an columns**

In [177]:
df1.shape

(300153, 11)

##### **Information about data**
##### **Data types are right**

In [178]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300153 entries, 0 to 300152
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   airline           300153 non-null  object
 1   flight            300153 non-null  object
 2   source_city       300153 non-null  object
 3   departure_time    300153 non-null  object
 4   stops             300153 non-null  object
 5   arrival_time      300153 non-null  object
 6   destination_city  300153 non-null  object
 7   class             300153 non-null  object
 8   duration          300153 non-null  float64
 9   days_left         300153 non-null  int64
 10  price             300153 non-null  int64
dtypes: float64(1), int64(2), object(8)
memory usage: 27.5+ MB

In [179]:
df1.describe()

            duration      days_left          price
count  300153.000000  300153.000000  300153.000000
mean       12.221021      26.004751   20889.660523
std         7.191997      13.561004   22697.767366
min         0.830000       1.000000    1105.000000
25%         6.830000      15.000000    4783.000000
50%        11.250000      26.000000    7425.000000
75%        16.170000      38.000000   42521.000000
max        49.830000      49.000000  123071.000000

##### **capitalize column first letter**

In [183]:
df1.columns = [col.capitalize() for col in df1.columns]
df1.head(2)

,Airline,Flight,Source_city,Departure_time,Stops,Arrival_time,Destination_city,Class,Duration,Days_left,Price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953

**columns and their unique values**

In [246]:
 for col in df1.select_dtypes(include='object').columns:
    print(df1[col].unique())

['SpiceJet' 'AirAsia' 'Vistara' 'GO_FIRST' 'Indigo' 'Air_India']
['SG-8709' 'SG-8157' 'I5-764' ... '6E-7127' '6E-7259' 'AI-433']
['Delhi' 'Mumbai' 'Bangalore' 'Kolkata' 'Hyderabad' 'Chennai']
['Evening' 'Early_Morning' 'Morning' 'Afternoon' 'Night' 'Late_Night']
['zero' 'one' 'two_or_more']
['Night' 'Morning' 'Early_Morning' 'Afternoon' 'Evening' 'Late_Night']
['Mumbai' 'Bangalore' 'Kolkata' 'Hyderabad' 'Chennai' 'Delhi']
['Economy' 'Business']

**no null values**

In [185]:
df.isnull().sum()

airline             0
flight              0
source_city         0
departure_time      0
stops               0
arrival_time        0
destination_city    0
class               0
duration            0
days_left           0
price               0
dtype: int64

**no duplicates**

In [187]:
 df1.duplicated().sum()

0

##### **duration = normal skew , bell curve**
##### **Days_left = left skew** 
##### **Price = right skew**

In [189]:
df1.skew(numeric_only=True)

Duration     0.602899
Days_left   -0.035464
Price        1.061377
dtype: float64

In [191]:
df1.kurt(numeric_only=True)

Duration    -0.268996
Days_left   -1.156215
Price       -0.396293
dtype: float64

# Second Table

**Read the data**

In [438]:
df2 = pd.read_csv('business.csv')
df2.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"

**captalize column first letter**

In [441]:
df2.columns = [col.capitalize() for col in df2.columns]
df2.head(2)

,Date,Airline,Ch_code,Num_code,Dep_time,From,Time_taken,Stop,Arr_time,To,Price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"

**Columns name**

In [ ]:
df2.columns

In [443]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93487 entries, 0 to 93486
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        93487 non-null  object
 1   Airline     93487 non-null  object
 2   Ch_code     93487 non-null  object
 3   Num_code    93487 non-null  int64
 4   Dep_time    93487 non-null  object
 5   From        93487 non-null  object
 6   Time_taken  93487 non-null  object
 7   Stop        93487 non-null  object
 8   Arr_time    93487 non-null  object
 9   To          93487 non-null  object
 10  Price       93487 non-null  object
dtypes: int64(1), object(10)
memory usage: 7.8+ MB

**Change the data type**

In [446]:
df2['Date'] = pd.to_datetime(df2['Date'], format='%d-%m-%Y')
df2['Dep_time'] = pd.to_datetime(df2['Dep_time'], format='%H:%M').dt.time
df2['Arr_time'] = pd.to_datetime(df2['Arr_time'], format='%H:%M').dt.time

In [448]:
df2['Price'] = df2['Price'].str.replace(',', '').astype(int)

**changing the data**

In [451]:
df2['Stop'] = df2['Stop'].str.replace('\n', '', regex=True).str.replace('\t', '', regex=True)

In [452]:
df2.head(2)

,Date,Airline,Ch_code,Num_code,Dep_time,From,Time_taken,Stop,Arr_time,To,Price
0,2022-02-11,Air India,AI,868,18:00:00,Delhi,02h 00m,non-stop,20:00:00,Mumbai,25612
1,2022-02-11,Air India,AI,624,19:00:00,Delhi,02h 15m,non-stop,21:15:00,Mumbai,25612

**No null values**

In [456]:
df2.isnull().sum()

Date          0
Airline       0
Ch_code       0
Num_code      0
Dep_time      0
From          0
Time_taken    0
Stop          0
Arr_time      0
To            0
Price         0
dtype: int64

In [458]:
df2.describe()

                                Date      Num_code          Price
count                          93487  93487.000000   93487.000000
mean   2022-03-07 17:48:16.458331136    780.056147   52540.081124
min              2022-02-11 00:00:00    401.000000   12000.000000
25%              2022-02-24 00:00:00    706.000000   45185.000000
50%              2022-03-08 00:00:00    820.000000   53164.000000
75%              2022-03-20 00:00:00    874.000000   60396.000000
max              2022-03-31 00:00:00    996.000000  123071.000000
std                              NaN    147.616038   12969.314606

**No duplicates value**

In [461]:
df2.duplicated().sum()

0

**Both are negative skewed , left skew**

In [464]:
df2.skew(numeric_only=True)

Num_code   -0.853750
Price      -0.095237
dtype: float64

In [466]:
df2.kurt(numeric_only=True)

Num_code   -0.028555
Price       0.810360
dtype: float64

In [470]:
df2.std(numeric_only=True)

Num_code      147.616038
Price       12969.314606
dtype: float64

# Third Table

In [473]:
df3 = pd.read_csv('economy.csv')
df3.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"

**Columns Name**

In [502]:
df3.columns

Index(['Date', 'Airline', 'Ch_code', 'Num_code', 'Dep_time', 'From',
       'Time_taken', 'Stop', 'Arr_time', 'To', 'Price'],
      dtype='object')

In [474]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206774 entries, 0 to 206773
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        206774 non-null  object
 1   airline     206774 non-null  object
 2   ch_code     206774 non-null  object
 3   num_code    206774 non-null  int64
 4   dep_time    206774 non-null  object
 5   from        206774 non-null  object
 6   time_taken  206774 non-null  object
 7   stop        206774 non-null  object
 8   arr_time    206774 non-null  object
 9   to          206774 non-null  object
 10  price       206774 non-null  object
dtypes: int64(1), object(10)
memory usage: 17.4+ MB

In [475]:
df3.columns = [col.capitalize() for col in df3.columns]
df3.head(2)

,Date,Airline,Ch_code,Num_code,Dep_time,From,Time_taken,Stop,Arr_time,To,Price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"

**changing the data type and data**

In [476]:
df3['Date'] = pd.to_datetime(df3['Date'], format='%d-%m-%Y')
df3['Dep_time'] = pd.to_datetime(df3['Dep_time'], format='%H:%M').dt.time
df3['Arr_time'] = pd.to_datetime(df3['Arr_time'], format='%H:%M').dt.time
df3['Price'] = df3['Price'].str.replace(',', '').astype(int)

In [490]:
df3['Stop'] = df3['Stop'].str.replace('\n', '', regex=True).str.replace('\t', '', regex=True)

**No null values**

In [505]:
df3.isnull().sum()

Date          0
Airline       0
Ch_code       0
Num_code      0
Dep_time      0
From          0
Time_taken    0
Stop          0
Arr_time      0
To            0
Price         0
dtype: int64

**2 duplicates only**

In [510]:
df3.duplicated().sum()

2

**Drop duplicates**

In [519]:
df3.drop_duplicates(inplace=True)

In [521]:
df3.duplicated().sum()

0

**Both are right skew**

In [524]:
df3.skew(numeric_only=True)

Num_code    2.155806
Price       1.703249
dtype: float64

**high weight on the right side**

In [529]:
df3.kurt(numeric_only=True)

Num_code    3.392807
Price       4.172751
dtype: float64